In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

## Удаление столбцов и строк. Отсутствующие значения.

In [3]:
df = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6], "C": [7, 8, np.nan]})
df

   A  B    C
0  1  4  7.0
1  2  5  8.0
2  3  6  NaN

Проверка на NaN-ы:

In [4]:
df.isna()

       A      B      C
0  False  False  False
1  False  False  False
2  False  False   True

In [5]:
df.isna().sum()

A    0
B    0
C    1
dtype: int64

Удалять строки и столбцы с пустыми значениями можно с помощию функции `dropna`. Обратите внимание, что применение функции без присваивания создает новый объект, а не меняет *df*.

In [6]:
df.dropna()

   A  B    C
0  1  4  7.0
1  2  5  8.0

Как и у многих других функций библиотек `numpy` и `pandas` есть аргумент `axis`, который отвечает за выбор: просмотр строк или просмотр столбцов:

In [7]:
df.dropna(axis = 0)

   A  B    C
0  1  4  7.0
1  2  5  8.0

In [8]:
df.dropna(axis = 1)

   A  B
0  1  4
1  2  5
2  3  6

Пропущенные значения можно не только удалить, но и заполнить:

In [9]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                   [3, 4, np.nan, 1],
                   [np.nan, np.nan, np.nan, np.nan],
                   [np.nan, 3, np.nan, 4]],
                columns=list("ABCD"))
df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0

Заполнить можно значением:

In [29]:
df.fillna(value=0)

     A    B    C    D
0  0.0  2.0  0.0  0.0
1  3.0  4.0  0.0  1.0
2  0.0  0.0  0.0  0.0
3  0.0  3.0  0.0  4.0

Словарем значений:

In [31]:
values = {"A": 1, "B": 1, "C": 2, "D": 3}
df.fillna(value=values)

     A    B    C    D
0  1.0  2.0  2.0  0.0
1  3.0  4.0  2.0  1.0
2  1.0  1.0  2.0  3.0
3  1.0  3.0  2.0  4.0

Методом заполнения вперед:

In [32]:
df.fillna(method="ffill")

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  3.0  4.0 NaN  1.0
3  3.0  3.0 NaN  4.0

Методом заполенения назад:

In [13]:
df.fillna(method="bfill")

     A    B   C    D
0  3.0  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  3.0 NaN  4.0
3  NaN  3.0 NaN  4.0

И, конечно, нужно уметь удалять ненужные столбцы. Для этого есть функция `drop`. Здесь мы уже не обращаем внимание на наличие или отсутствие пустых значений. Параметрами подаются список названий колонок для удаления, и часто указывается `axis=1`, т.к. по умолчанию считается axis=0, в этом случае поиск будет по индексам строк.

In [14]:
df.drop(["C"], axis = 1)

     A    B    D
0  NaN  2.0  0.0
1  3.0  4.0  1.0
2  NaN  NaN  NaN
3  NaN  3.0  4.0

In [15]:
df.fillna(method="bfill").drop(["A", "C"], axis = 1)

     B    D
0  2.0  0.0
1  4.0  1.0
2  3.0  4.0
3  3.0  4.0

Функция `drop` также не изменяет исходный объект, а создает новый. Для изменения исходного объекта нужно присвоить ему этот результат:

In [16]:
df = df.fillna(method="bfill").drop(["A", "C"], axis = 1)

In [17]:
df

     B    D
0  2.0  0.0
1  4.0  1.0
2  3.0  4.0
3  3.0  4.0

Еще пара способов:

In [50]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                   [3, 4, np.nan, 1],
                   [np.nan, np.nan, np.nan, np.nan],
                   [np.nan, 3, np.nan, 4]],
                columns=list("ABCD"))
df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0

In [51]:
df.mean()

A    3.000000
B    3.000000
C         NaN
D    1.666667
dtype: float64

In [52]:
df.fillna(df.mean())

     A    B   C         D
0  3.0  2.0 NaN  0.000000
1  3.0  4.0 NaN  1.000000
2  3.0  3.0 NaN  1.666667
3  3.0  3.0 NaN  4.000000

In [53]:
df.fillna(df.min())

     A    B   C    D
0  3.0  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  3.0  2.0 NaN  0.0
3  3.0  3.0 NaN  4.0

In [54]:
df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0

In [60]:
df.max()

A    3.0
B    4.0
C    NaN
D    4.0
dtype: float64

In [55]:
df.fillna(df.min()).fillna(df.max().min())

     A    B    C    D
0  3.0  2.0  3.0  0.0
1  3.0  4.0  3.0  1.0
2  3.0  2.0  3.0  0.0
3  3.0  3.0  3.0  4.0

**Упражнение 1.** Объясните, как работает ячейка выше.

In [61]:
Сначала df.fillna(df.min()) это помогает нам заполнить пустые ячейки минимальным элементом своего столбца. А затем fillna(df.max().min()) уже те значения, которые все еще остались не заполнены, заполняются минимальным значением максимума, каждого столбца

SyntaxError: invalid syntax (3715379591.py, line 1)

**Упражнение 2.** Дан датафрейм в ячейке ниже, состоящий из 4 единиц на диагонали и nan-ов. Заполнить его так, чтобы в нем было 8 единиц и 8 двоек. Использовать только `fillna`.

In [114]:
df = pd.DataFrame([[1, np.nan, np.nan, np.nan],
                   [np.nan, 1, np.nan, np.nan],
                   [np.nan, np.nan, 1, np.nan],
                   [np.nan, np.nan, np.nan, 1]],
                columns=list("ABCD"))
df

     A    B    C    D
0  1.0  NaN  NaN  NaN
1  NaN  1.0  NaN  NaN
2  NaN  NaN  1.0  NaN
3  NaN  NaN  NaN  1.0

In [115]:
df

     A    B    C    D
0  1.0  NaN  NaN  NaN
1  NaN  1.0  NaN  NaN
2  NaN  NaN  1.0  NaN
3  NaN  NaN  NaN  1.0

In [117]:

df[["A", "C"]] = df[["A","C"]].fillna(method='ffill')
# df.fillna(method="ffill")
df=df.fillna(2)
df

     A    B    C    D
0  1.0  2.0  2.0  2.0
1  1.0  1.0  2.0  2.0
2  1.0  2.0  1.0  2.0
3  1.0  2.0  1.0  1.0

**Упражнение 3.** Из полученного датафрейма удалить столбец (или столбцы) с минимальной суммой значений.

In [130]:
df.columns[df.sum().argmin()]

'A'

In [134]:
df.drop(df.columns[df.sum().argmin()], axis=1)

     B    C    D
0  2.0  2.0  2.0
1  1.0  2.0  2.0
2  2.0  1.0  2.0
3  2.0  1.0  1.0

4.0

## Еще работа с данными. Пассажиры Титаника.

In [156]:
df = pd.read_csv('/home-local/student/Downloads/lab7/train.csv') #поменять путь на актуальный для вас

In [157]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [25]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [26]:
df.shape

(891, 12)

**Упражнение 4.** Найдите средний возраст пассажиров

In [158]:
df.agg({"Age": "mean"})

Age    29.699118
dtype: float64

**Упражнение 5.** Выведите имя самого молодого пассажира.

In [165]:
df.iloc[df[["Age"]].idxmin()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C

**Упражнение 6.** Посчитайте доли пассажиров по классам обслуживания (Pclass)

In [186]:
print("Dolya 1 classa", df[df["Pclass"] == 1].shape[0]/df.shape[0])
print("Dolya 2 classa", df[df["Pclass"] == 2].shape[0]/df.shape[0])
print("Dolya 3 classa", df[df["Pclass"] == 3].shape[0]/df.shape[0])

Dolya 1 classa 0.24242424242424243
Dolya 2 classa 0.20650953984287318
Dolya 3 classa 0.5510662177328844

**Упражнение 7.** Найдите средние возраста пассажиров по классам обслуживания.

In [188]:
df.groupby(["Pclass"]).agg({"Age": "mean"})

              Age
Pclass
1       38.233441
2       29.877630
3       25.140620

**Упражнение 8.** Удалите столбец с наибольшим числом пропусков.

In [205]:
df.drop([df.isna().sum().idxmax()], axis=1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,Q

In [242]:
df.isna().sum().idxmax()
df.columns[df.nunique() == df.nunique().max()]

Index(['PassengerId', 'Name'], dtype='object')

**Упражнение 9.** Удалите столбцы с наибольшим числом уникальных значений.

In [243]:
df.drop(df.columns[df.nunique() == df.nunique().max()], axis=1)

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,0,3,male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,211536,13.0000,NaN,S
887,1,1,female,19.0,0,0,112053,30.0000,B42,S
888,0,3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,1,1,male,26.0,0,0,111369,30.0000,C148,C
890,0,3,male,32.0,0,0,370376,7.7500,NaN,Q

**Упражнение 10.** Найдите доли выживших среди мужчин, среди женщин и среди всех пассажиров.

In [260]:
print("Dolya male vigivshih", df[(df["Survived"]==1) & (df["Sex"]== "male")].shape[0]/df.shape[0])
print("Dolya vsex vigivshih", df[(df["Survived"]==1)].shape[0]/df.shape[0])
print("Dolya female vigivshih", df[(df["Survived"]==1) & (df["Sex"]== "female")].shape[0]/df.shape[0])

Dolya male vigivshih 0.122334455667789
Dolya vsex vigivshih 0.3838383838383838
Dolya female vigivshih 0.2615039281705948

**Упражнение 11.** Найдите доли выживших по классам обслуживания.

In [265]:
print("Dolya  vigivshih 1 classa", df[(df["Survived"]==1) & (df["Pclass"]== 1)].shape[0]/df.shape[0])
print("Dolya vigivshih 2 classa ", df[(df["Survived"]==1) & (df["Pclass"]== 2)].shape[0]/df.shape[0])
print("Dolya vigivshih 3 classa", df[(df["Survived"]==1) & (df["Pclass"]== 3)].shape[0]/df.shape[0])

Dolya  vigivshih 1 classa 0.1526374859708193
Dolya vigivshih 2 classa  0.09764309764309764
Dolya vigivshih 3 classa 0.1335578002244669

**Упражнение 12.** Найдите доли выживших среди возрастных категорий 18-, 18-60, 60+.